Laur59/uKOS-X-IWYU/Ports/Targets/MAiXDUiNO_K210/Base/Tools/test_ipi/test_ipi.c
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
SPDX-FileCopyrightText: 2025-2026 Laurent von Allmen
*/

/*
; test_ipi.
; =========

;------------------------------------------------------------------------
; Project: uKOS-X
;
; Purpose:
;   Preliminary test of the ipi.
;
;   core 0                  core 1
;   test_ipi -generate      counter[core 1]++
;   counter[core 0]++       test_ipi -generate
;
;   test_ipi -display       test_ipi -display
;   counter[core 0]         counter[core 1]
;
;-----
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#define     _POSIX_C_SOURCE     200809L

#include    <inttypes.h>
#include    <stdio.h>

#include    "Registers/K210_clint.h"
#include    "Registers/rv64_csr.h"
#include    "Registers/soc_vectors.h"
#include    "core.h"
#include    "macros.h"
#include    "macros_core.h"
#include    "macros_soc.h"
#include    "modules.h"
#include    "serial/serial.h"
#include    "text/text.h"
#include    "types.h"

// uKOS-X specific (see the module.h)
// ==================================

// ----------------------------------I------------I-----------------------------------------I--------------I

STRG_LOC_CONST(aStrApplication[]) = "test_ipi     preliminary ipi test.                     (c) EFr-2026";
STRG_LOC_CONST(aStrHelp[])        = "Test of the cores\n"
                                    "=================\n\n"

                                    "This tool performs a preliminary ipi tests.\n\n"

                                    "Input format:  test_ipi -generate/-display\n"
                                    "Output format: [result]\n\n"

                                    "Module built on "__DATE__"  "__TIME__" (c) EFr-2026\n\n";

// Prototypes

static  int32_t     test_ipi_pre_init(uint32_t argc, const char_t *argv[]);
static  int32_t     prgm(uint32_t argc, const char_t *argv[]);
static  void        local_machineSoftware_IRQHandler(uint32_t core, uint64_t parameter);

MODULE(
    Test_ipi,                                   // Module name (the first letter has to be upper case)
    KID_FAM_CLI,                                // Family (defined in the module.h)
    (((uint32_t)'_'<<8U)+(uint32_t)'M'),        // Module identifier (defined in the module.h)
    test_ipi_pre_init,                          // Address of the initialisation code (early pre-init)
    prgm,                                       // Address of the code (prgm for tools, aStart for applications, NULL for libraries)
    NULL,                                       // Address of the clean code (clean the module)
    " 1.0",                                     // Revision string (major . minor)
    ((1U<<BSHOW) | (1U<<BEXE_CONSOLE)),         // Flags (BSHOW = visible with "man", BEXE_CONSOLE = executable, BCONFIDENTIAL = hidden)
    0                                           // Execution cores
);

// CLI tool specific
// =================

static  volatile    uint8_t     vCounter[KNB_CORES] = MCSET(0U);
static  volatile    bool        vDataAvailable[KNB_CORES] = MCSET(false);

/*
 * \brief Main entry point
 *
 */
static  int32_t prgm(uint32_t argc, const char_t *argv[]) {
    uint32_t    core, destCore;
    bool        display = false, generate = false;

    core = GET_RUNNING_CORE;
    (void)dprintf(KSYST, "Ipi test.\n");

    switch (argc) {
        case 2: {
            text_checkAsciiBuffer(argv[1], "-display",  &display);
            if (display) {
                if (vDataAvailable[core]) {
                    vDataAvailable[core] = false;
                    (void)dprintf(KSYST, "Counter = %"PRIu8"\n", vCounter[core]);
                }
                else {
                    (void)dprintf(KSYST, "No data!\n");
                }
                break;
            }
            text_checkAsciiBuffer(argv[1], "-generate",  &generate);
            if (generate) {
                destCore = (core == KCORE_0) ? 1U : 0U;
                if (clint->msip[destCore].msip == 0U) {
                    clint->msip[destCore].msip = 1U;
                }
                else {
                    (void)dprintf(KSYST, "Channel busy!\n");
                }
                break;
            }
            break;
        }
        default: {

// Make MISRA happy :-)

            break;
        }
    }
    return EXIT_OS_SUCCESS_CLI;
}

/*
 * \brief test_ipi_pre_init
 *
 * - Initialise the interruption vector
 *
 */
static  int32_t test_ipi_pre_init(uint32_t argc, const char_t *argv[]) {
    uint32_t    core;

    UNUSED(argc);
    UNUSED(argv);

    core = GET_RUNNING_CORE;

    INT_INTERRUPT_VECTOR(IINT_MACHINE_SOFTWARE, local_machineSoftware_IRQHandler);

    clint->msip[core].msip = 0U;
    core_setBitCSR(RV_CSR_MIE, ((uint64_t)1U<<(uint64_t)IINT_MACHINE_SOFTWARE));
    return EXIT_OS_SUCCESS;
}

/*
 * \brief local_machineSoftware_IRQHandler
 *
 * - Increment a counter
 *
 */
static  void    local_machineSoftware_IRQHandler(uint32_t core, uint64_t parameter) {

    UNUSED(parameter);

    clint->msip[core].msip = 0U;
    vCounter[core]++;
    vDataAvailable[core] = true;
}
